/*
    콜백 함수 연습
    2022.10.7

*/
//----------------------------------------------------------------------------------
//호출값으로 사용
let printHello = function(){
    console.log("Hello");
}

let helloJS = ()  => {
    console.log("Hello Javascript");
}
//호출시 변수이름을 함수 이름처럼 실행
//----------------------------------------------------------------------------------
printHello();
//----------------------------------------------------------------------------------
//콜백 함수
function call5times(f){
    for(let i=0; i < 5; i++)
    f(); //매개변수로 전달된 함수를 호출
}

helloJS();
console.log(`--------------------------------------------------------------`)
call5times(helloJS);
//----------------------------------------------------------------------------------
//반환값으로 사용됨
//----------------------------------------------------------------------------------
function helloMaker(host){
    let sayHello = function(guest) {
        console.log(`안녕하세요 ${guest}씨, 저는 ${host}입니다.`);
    }
    return sayHello;
}
//----------------------------------------------------------------------------------
let hong = helloMaker("홍길동") 
hong("이순신");

//----------------------------------------------------------------------------------
setTimeout(printHello, 2000) //2초후에 printhello에 저장된 함수 실행-한번실행,단발성